# fmt: off

replies = {
    0: "Дорогой друг, {fullname}, жду вашего вопроса✍️\n",
    # 0: "Здравствуй, мой дорогой любимый друг {fullname}!\n\n"
    #   "🌟 Сейчас я задам вам всего несколько ключевых вопросов — это поможет мне создать идеально подходящие "
    #   "рекомендации именно для вашего участка.\n\n"
    #   "Как это работает:\n\n"
    #   "✔️ Я последовательно задам 3 коротких вопроса\n"
    #   "✔️  Вы отвечаете в удобном формате — текстом или голосом\n"
    #  "✔️ Сразу после этого получите персонализированную подборку с:\n"
    #   "🔸 Рекомендованными растениями и их фото\n"
    #   "🔸 Схемами посадок\n"
    #   "🔸 Инструкциями по уходу\n\n"
    #   "Не переживайте:\n\n"
    #   "🔹 Все ответы можно будет изменить позже\n"
    #   "🔹 Это займет меньше минуты\n"
    #   "🔹 Результат сэкономит вам часы поиска информации\n"
    #   "Готовы начать? Сейчас задам первый вопрос!", '''
    1: "Добрый день, дорогой {fullname}!\n"
       "🌿 Рад снова видеть вас! Мы сохранили ваши предыдущие настройки, чтобы сделать процесс еще проще. "
       "Хочется ли вам продолжить работу над проектом или скорректировать какие-то детали? Например, размер, "
       "местоположение или состояние — вы можете обновить их сейчас или сразу начать генерировать идеи!",
    2: "{fullname}, я работаю над вашим предыдущим запросом. Чтобы ничего не упустить, пожалуйста, "
       "отправляйте вопросы по одному. Сейчас я уже в процессе — скоро дам ответ! 🌱 ⏳",
    "photo_limit_exceeded": "Дорогой подписчик! 🌸\n"
                            "Ваш пакет 50 фото в этом цикле закончился (напоминаем, <b>что все фото, даже купленные, "
                            "обнуляются в начале каждого цикла подписки</b>). Но вы можете:\n"
                            "✅ <b>Докупить 50 фото за 150₽</b> — они будут доступны до конца текущего цикла.\n"
                            "✅ <b>Подождать до начала следующего цикла</b> — лимит восстановится автоматически.\n\n"
                            "Спасибо, что остаётесь с нами💚",
    "action_limit_exceeded": 'Ну как тебе, дорогой друг? 🌸✨ Понравились мои советы?\n'
                             'В скором времени ты сможешь использовать еще больше <b>новых возможностей.</b>\n'
                             'Оформи подписку сейчас — и первым получишь доступ к этим инновациям! 🌿\n'
                             'Ваша подписка продлится  автоматически 🔄, но вы в управлении!\n'
                             'Если не хотите автопродления — просто отмените его в разделе поддержка.\n\n'
                             'Хочешь узнать больше, ознакомиться и быть в курсе новостей?\n'
                             '<b>Приглашаем в наш телеграмм канал <a href="https://t.me/suslik_home">Суслика</a>\n\n\n'
                             'Не тяните — ваши растения заслуживают эксперта! '
                             'Подпишитесь, и я подарю вам зеленый рай! 🌳\n\n'
                             '🔸 "Суслик Лайт"\n'
                             'Ежемесячно: <s>790₽</s> 390₽.\n\n'
                             '🔹 "Суслик PRO: год заботы 💚"\n'
                             'Годовая подписка: <s>9480₽</s> 3900₽.</b>🎁\n\n',
    "action_limit_exceeded_log": "User {username} has exceeded the action limit.",
    "message_lenght_limit_exceeded_log": "User {username} has exceeded the message lenght limit.",
    "pictures_limit_exceeded_log": "User {username} has exceeded the pictures limit.",
    "message_lenght_limit_exceeded": "Привет! Кажется, наш суслик-аналитик запутался в таком большом тексте. "
                                     "😅 Попробуйте отправить сообщение покороче — он станет быстрее и эффективнее! "
                                     "📋 До встречи в следующем диалоге! 🌱",
    "users_limit_exceeded": "Кажется, наш суслик устал от новых друзей! 😅\n"
                            "Мы временно приостановили набор, чтобы не перегружать сервис.\n"
                            "<b>Варианты:</b>\n"
                            "🔸 Напишите нам на suslikaibot@gmail.com — может, мы договоримся!\n"
                            "🔸 Или подождите немного: новые места появятся, как только наш сад вырастет.\n"
                            "Спасибо за терпение! 🌳"
}

space_question = {
    1: "Какое пространство вы хотите преобразить? 📏 Например, небольшой балкончик или просторный сад. "
       "Это поможет мне понять масштаб работы и подобрать подходящие растения.",
    2: "Пожалуйста, укажите площадь вашего пространства. 🌳 Например, 10 м² или 5 соток. "
       "Это ключевая информация для выбора растений и материалов.",
    3: "Каков размер вашего участка или помещения? 🌸 "
       "Это важно, чтобы понять, какие решения будут оптимальными для вашего пространства.",
    4: "Знаете, почему каждое пространство так важно? Потому что оно отражает вашу индивидуальность! 🌄\n"
       "Расскажите мне, какой у вас размер территории или помещения? Это может быть скромная студия, где каждый "
       "квадратный метр на счету, или просторный садовый участок, где можно создать настоящий природный шедевр. "
       "Ваше описание поможет нам начать работу!",
    5: "Какое пространство вы хотите озеленить? 🌿 "
       "Например, небольшая лоджия или большой сад. Поделитесь размерами — "
       "это поможет мне подобрать подходящие растения.",
    6: "Дорогой друг, давайте представим ваше пространство во всех деталях. 🌿 Каков его размер? "
       "Возможно, это небольшая комната, где каждый квадратный метр имеет значение, или просторный участок, "
       "где можно создать целый мир из растений и цветов.",
    7: "Каждое пространство — это как новая глава в книге жизни. 🌄 "
       "Расскажите мне, пожалуйста, какой у вас размер территории или помещения? Это может быть уютная студия, "
       "где каждый элемент важен, или широкий садовый участок, где можно создать настоящий природный шедевр. "
       "Ваше описание поможет нам написать эту главу вместе!",
    8: "Чтобы создать идеальный план, важно понять все особенности вашего пространства. 🌳  "
       "Может быть, это небольшая комнатка, где каждый уголок важен, или просторный участок, где можно создать "
       "настоящий природный шедевр?",
    9: "Какое пространство вы хотите преобразить? 🌱 "
       "Например, небольшая веранда или участок площадью 300 м². Это ключевая информация для планирования.",
    0: "Пожалуйста, укажите размер вашего пространства. "
       "🌳 Например, комната 10 м² или участок в 5 соток. Это важно для выбора материалов и растений.",
}

space_reaction = {
    1: "Спасибо за описание. 🌱 Теперь я знаю размер вашего пространства. Это важно для планирования.",
    2: "Этот размер — идеальное начало! 🌺 Давайте вместе превратим его в шедевр! 😊💖 Ваше видение вдохновляет!",
    3: "Спасибо за ответ. 🌳 Теперь я понимаю масштаб вашего пространства. "
       "Это поможет мне сделать рекомендации точными.",
    4: "Ваш выбор впечатляет! Этот размер — идеальная площадка для ваших идей. "
       "🌳 Давайте вместе создадим проект, который будет отражать вашу уникальность! 😊",
    5: "Спасибо за информацию. 🌳 Теперь я могу работать с вашими параметрами. Это улучшит качество проекта.",
    6: "Благодарю за уточнение. 🌱 Теперь я знаю, какое пространство мы имеем в распоряжении. "
       "Это позволит сделать рекомендации точными.",
    7: "Спасибо за ваш ответ. 🌿 Теперь я могу учесть параметры вашего пространства. "
       "Мы создадим проект, который подойдет именно вам.",
    8: "Ценю ваше участие. 🌳 Теперь я знаю размер вашего пространства. "
       "Это поможет мне сделать рекомендации практичными.",
    9: "Благодарю за уточнение. 🌿 Теперь я могу работать с вашими размерами. "
       "Мы создадим проект, который будет устойчивым и эффективным.",
    0: "Спасибо за доверие. 🌸 Теперь я знаю параметры вашего пространства. "
       "Это упростит создание персонализированного плана.",
}

geography_question = {
    1: "Каждое место на Земле имеет свою историю. Расскажите мне, пожалуйста, из какого вы города или региона?🌍\n"
       "Это может быть 'Казань' или 'Хабаровск'. "
       "Ваш ответ поможет нам создать проект, который будет идеально соответствовать вашим условиям!",
    2: "Укажите ваш регион или город. 🌳 Это ключевая информация для выбора растений и материалов, "
       "которые подходят под ваши условия. "
       "Расскажите мне, и мы создадим проект, который будет идеально соответствовать вашим условиям!",
    3: "Представьте, что ваше местоположение — это карта, на которой мы будем строить ваш идеальный оазис. 🌏\n"
       "Где находится ваше пространство?  Например, в Москве или Краснодарском крае. Это важно для планирования.",
    4: "Расскажите, пожалуйста, о вашем регионе. "
       "🌳 Например, северный край или южное побережье. Это помогает мне выбрать подходящие решения.",
    5: "Из какого вы города или региона?Какой климатический регион вас окружает? "
       "🌱 Например, умеренный или субтропический. Это важно для подбора растений.",
    6: "Назовите ваш город или регион. 🌳 Это помогает мне подобрать растения, которые будут процветать именно у вас.",
    7: "Каждый регион — это как новая глава в книге природы. Расскажите мне, пожалуйста, "
       "из какого вы города или региона? 🌍\nЭто может быть 'уютный сельский уголок' или "
       "'широкие городские просторы'. Ваш ответ поможет нам начать писать эту историю вместе!",
    8: "Чтобы создать идеальный проект, важно понять все особенности вашего места.\n"
       "Укажите ваш регион. 🌳 Например, центр России или Кавказ. Это важно для выбора растений и их ухода. "
       "Расскажите мне, и мы создадим проект, который будет идеально гармонировать с вашей территорией!",
    9: "Какой город или регион вы называете своим? "
       "🌱 Это помогает мне подобрать решения, которые будут работать в ваших условиях.",
    0: "Расскажите, пожалуйста, о вашем регионе или городе. "
       "🌳 Например, холодный климат или сухой. Это важно для планирования.",
}

geography_reaction = {
    1: "Спасибо за уточнение. "
       "🌱 Теперь я знаю особенности вашего местоположения. Это поможет создать проект, который будет устойчивым.",
    2: "Благодарю за ответ. "
       "💹 Теперь я могу учесть климатические особенности. Это улучшит качество рекомендаций.",
    3: "Какое очаровательное место вы выбрали! Спасибо за описание. "
       "🌿 Теперь я знаю ваши географические условия. Это сделает проект более персонализированным.",
    4: "Ценю ваше внимание.  "
       "🌿  Теперь я могу учесть погодные факторы. Мы создадим проект, который будет работать именно у вас.",
    5: "Благодарю за информацию. "
       "🌸 Теперь я знаю особенности вашего климата. Это упростит планирование.",
    6: "Спасибо за уточнение. "
       "💹 Теперь я могу сделать рекомендации более точными и практичными.",
    7: "Ценю ваше участие. "
       "🌿 Теперь я знаю ваше местоположение. Это позволит создать проект, который будет гармонировать с природой.",
    8: "Спасибо за описание. "
       "🌸 Теперь я могу учесть особенности почвы и температуры. Это улучшит качество проекта.",
    9: "Благодарю за доверие. "
       "🌸 Теперь я знаю ваши географические параметры. Это сделает проект более устойчивым.",
    0: "Спасибо за ответ. "
       "🌿 Теперь я могу подобрать подходящие растения. Это упростит уход за вашим пространством.",
}

request_question = {
    1: "Что хочешь изменить в саду или доме?\n"
       "🌸 Например, растения сохнут или хочется больше цветов? "
       "И что для тебя важнее всего: простота ухода безопасность для детей/питомцев?",
    2: "Что тебя беспокоит?\n"
       "🌱 Например, листья желтеют или цветы не цветут? "
       "И что для тебя важнее: красота или безопасность для детей/питомцев?",
    3: "Какие задачи хочешь решить?\n"
       "🌳 Например, борьба с вредителями или экономия времени на уходе? "
       "И что для тебя важнее: красота или безопасность для детей/питомцев?",
    4: "Что не так с твоими растениями?\n"
       "🌸 Например, они болеют или не цветут? "
       "А что для тебя главное: чтобы всё было проще или чтобы оазис выглядел идеально? "
       "А может безопасность для детей/питомцев?",
    5: "Какие проблемы хочешь решить?\n"
       "🌿 Например, сухие листья или медленный рост? "
       "И что для тебя важнее: простота ухода, экологичность или безопасность для детей/питомцев?",
    6: "Что тебя волнует в твоем пространстве?\n"
       "🌳 Например, растения сохнут или ты хочешь, чтобы всё цвело дольше? "
       "А что для тебя главное: красота или безопасность для детей/питомцев?",
    7: "Какие задачи ты ставишь перед пространством?\n"
       "🌸 Например, защита от вредителей или создание уютной зоны отдыха? "
       "А что для тебя важнее всего: простой уход, эстетика или безопасность для детей/питомцев?",
    8: "Что хочешь исправить?\n"
       "🌱 Например, болезни растений или нерегулярное цветение? "
       "А что для тебя главное: чтобы всё было гипоаллергенно или чтобы сад радовал глаз?",
    9: "Какие проблемы тебя волнуют?\n"
       "🌳 Например, сухие цветы или медленный рост? "
       "И что для тебя важнее: простота или красота? А может приоритет в безопасности детей/питомцев?",
    0: "Что хочешь изменить?\n"
       "🌸 Например, растения не цветут или ты хочешь защитить их от вредителей? "
       "А что для тебя главное: чтобы уход был несложным или чтобы всё смотрелось идеально? "
       "Важна ли безопасность для детей/питомцев?",
}

request_reaction = {
    1: "Спасибо! Теперь я знаю, с чего начать. Давай работать над этим!",
    2: "Окей, я понял! Это важно для подбора решений. Давай дальше!",
    3: "Спасибо! Теперь я знаю, как помочь. Давай начнем!",
    4: "Хорошо я запомнил! Это важно для подбора советов.",
    5: "Спасибо за описание! Теперь я знаю, с чего начать.",
    6: "Хорошо, я понял! Давай работать над этим.",
    7: "Спасибо! Это поможет мне дать точные советы.",
    8: "Окей, я запомнил! Давай дальше!",
    9: "Спасибо за информацию! Теперь я знаю, как помочь.",
    0: "Окей, я понял! Давай начинать!",
}


payment_text = {
    "capability": "<b>🌟 Мои возможности:</b>\n\n"
                  "🌱 Персональные рекомендации — подберу растения под ваш бюджет , климат и стиль.\n"
                  "📸 Анализ фото — определю вид растения, оценю его состояние и выявлю вредителей или болезни "
                  "(просто отправьте снимок!).\n"
                  "🎤 Голосовые запросы — можете говорить со мной вслух, я пойму!\n"
                  "📝 Память и гибкость — помню ваши предпочтения, но их можно изменить в любой момент.\n"
                  "🌟 Визуальная помощь — к каждому растению прикреплю ссылку на фото, "
                  "чтобы вы не тратили время на поиски.\n"
                  "💡 Экспертные советы — расскажу про полив, подкормку, грунт, обрезку и защиту от вредителей.\n\n",
    "free actions": "Вы получаете <b>5 бесплатных запросов</b>\n"
                    "🌳✨(включая анализ фото растений). Например:\n"
                    "<i>«Что с этим кустом?» </i>(отправьте фото).\n"
                    "<i>«Какие растения подойдут для тенистого балкона?»\n"
                    "«Как правильно посадить саженцы?»</i>\n"
                    "Просто задавайте — мы ответим! После 5 действий вы сможете выбрать тариф. Давайте начнем!",
    "1 month success": "🌸 Ваша подписка <b>«Суслик Лайт»</b> активирована! Теперь вы получаете персональные советы, "
                       "анализ 50 фотографий и возможность изменить предпочтения в любой момент. Спасибо за доверие! "
                       "Если возникнут вопросы, всегда пишите в техподдержку. 🌿✨",
    "1 year success": "Ура! 🎉 Вы выбрали долгосрочное сотрудничество! "
                      "Ваша годовая подписка активирована — это значит, вы получаете 12 "
                      "месяцев зеленой магии, 50 фото для анализа каждый месяц и экономите более 40%! 💰",
    "refresh_pictures_limit_success": "Ура! 🌿✨\n"
                                      "Вы активировали <b>новый пакет фото</b> — теперь можете отправлять снимки "
                                      "растений без ограничений до конца цикла! Спасибо, что так активно "
                                      "заботитесь о своем саде — это вдохновляет нас помогать вам ещё лучше! 💚",
    "payment error": "Упс! Кажется, что-то пошло не так с платежом.\n"
                     "🔄 Ничего страшного — бывают мелкие накладки. "
                     "Пожалуйста, проверьте данные и повторите попытку. Если проблема сохранится, "
                     "мы обязательно поможем вам решить её. Ваш идеальный оазис уже готовится к встрече с вами!",
    "payment_url_text": "{description}\nДля оплаты нажмите кнопку и перейдите по ссылке.",
    "cancel_payment": "Отменить автопродление? 🌳\n"
                      "🔹 Подписка закончится <b>{date}</b>.\n"
                      "🔹 Ваш профиль и история запросов сохранятся — вы всегда сможете вернуться.\n"
                      "🔹 Советы, напоминания и анализ фото станут недоступны после окончания срока.",
    "payment_cancelled": "Подписка отменена — но мы не прощаемся! 🐹\n"
                         "🔸 <b>Окончание:</b> {date}.\n"
                         "🔸 <b>Профиль сохранится</b> — вы можете вернуться в любой момент.\n"
                         "🔸 <b>Функции станут доступны</b> при повторной подписке.\n"
                         "Если у вас есть идеи, как сделать наш сервис лучше — "
                         "поделитесь с нами <code>suslikaibot@gmail.com</code>! "
                         "Мы ценим вашу обратную связь.",
    "user_payment_log": "User {username} has paid for {payload}. Payment type: {payment_type}",
    "user_gift_payment_log": "User {username} has paid for gift subscription to {target_username}. Amount: {amount}",
    "user_payment_error_log": "User {username} has failed to pay for {payload}.\n"
                              "Payment type: {payment_type}\n"
                              "Error: {error}",
    "gift_sub": "Чтобы выбрать пользователя, кому подарить подписку, нажмите кнопку ниже",
    "gift_sub_user": "Вы выбрали пользователя {}.\n"
                     "Подарок будет действовать 12 месяцев — персональные рекомендации, "
                     "анализ фото, голосовые запросы и экспертные советы",
    "gift_sub_no_user": "Этого пользователя нет в базе, отправте ему ссылку на бота и попросите нажать /start",
    "gift_sub_report_to_buyer": "Ура! Вы подарили {username} годовую подписку! 🌿\n"
                                "Теперь он сможет получать персональные рекомендации, анализ фото, "
                                "экспертные советы с помощью голосового запроса.",
    "gift_sub_report_to_receiver": "🎁 <b>Кто-то щедрый подарил вам годовую подписку! </b>🌿\n"
                                   "Теперь вы получите 12 месяцев зеленой магии:\n"
                                   "🌱 Персональные рекомендации — подберу растения под ваш бюджет, климат и стиль.\n"
                                   "📸 Анализ фото — определю вид растения, оценю его состояние "
                                   "и выявлю вредителей или болезни (просто отправьте снимок!).\n"
                                   "🎤 Голосовые запросы — можете говорить со мной вслух, я пойму!\n"
                                   "📝 Память и гибкость — помню ваши предпочтения, "
                                   "но их можно изменить в любой момент.\n"
                                   "🌟 Визуальная помощь — к каждому растению прикреплю ссылку на фото, "
                                   "чтобы вы не тратили время на поиски.\n"
                                   "💡 Экспертные советы — расскажу про полив, подкормку, грунт, "
                                   "обрезку и защиту от вредителей",
}
support_text = {
    "subscribed": "Здравствуйте! 🌿 Дней до конца подписки: {days}. Осталось фото: {photos}\n"
                  "Вы обратились в техническую поддержку «Суслик». Наша команда готова помочь с любыми вопросами:\n"
                  "🔸 Проблемы с платежом.\n"
                  "🔸 Не работает анализ фото.\n"
                  "🔸 Непонятные советы.\n"
                  "Для оперативного решения:\n"
                  "1. Опишите проблему подробно.\n"
                  "2. Приложите скриншоты или фото (если это связано с ошибкой).\n"
                  "Также можете написать нам на <code>suslikaibot@gmail.com</code> "
                  "— мы ответим в течение 24 часов! 🌿📧",
    "unsubscribed": "Здравствуйте! 🌿 У вас осталось запросов: {actions}.\n"
                    "Вы обратились в техническую поддержку «Суслик». Наша команда готова помочь с любыми вопросами:\n"
                    "🔸 Проблемы с платежом.\n"
                    "🔸 Не работает анализ фото.\n"
                    "🔸 Непонятные советы.\n"
                    "Для оперативного решения:\n"
                    "1. Опишите проблему подробно.\n"
                    "2. Приложите скриншоты или фото (если это связано с ошибкой).\n"
                    "Также можете написать нам на <code>suslikaibot@gmail.com</code> "
                    "— мы ответим в течение 24 часов! 🌿📧\n\n",
    "subscription_2_days_left": "Ой, суслик-календарь тикает! 🕒\nДо конца вашей подписки осталось <b>2 дня</b>.\n"
                                "Не дайте советам, напоминаниям и фото анализам исчезнуть — <b>продлите подписку</b>, "
                                "и ваш сад останется в заботе!\n"
                                "🌿<i>P.S. Все ваши настройки и история запросов сохранятся — "
                                "просто нажмите «Подписаться» снова!</i> 🌸",
    "subscription_0_days_left": "<b>Подписка истекла</b> — ваш суслик-аналитик ушел в спячку 🐹💤\n"
                                "Не переживайте — профиль сохранён, и вы можете вернуться в любое время.\n"
                                "<b>Продлите</b> — и мы вернемся к работе вместе через 1 клик!",
}

ORDER = ["space", "geography", "request"]

QUESTIONS = {
    "space": space_question,
    "geography": geography_question,
    "request": request_question,
}

REACTIONS = {
    "space": space_reaction,
    "geography": geography_reaction,
    "request": request_reaction,
}

WELCOME_BY_SOURCE = {
    "pitomnik": {
        "photo": "src/bot/data/pitomnik.png",
        "text": "Тебя приветсвует магазин 'Питомник растений', он позоботился о тебе . У тебя есть 3 запроса фото",
        "onboarding": "onboarding_3",
    },
    "ads": {
        "photo": "src/bot/data/zvetochki.jpg",
        "text": "Тебя приветсвует магазин 'Цветочки в горшочках', он позоботился о тебе . У тебя есть 3 запроса фото",
        "onboarding": "onboarding_3",
    },
    "event": {
        "photo": "src/bot/data/taking_photo.png",
        "text": "Попробуй обязательно!",
        "onboarding": "onboarding_3",
    },
    "stol": {
        "photo": "src/bot/data/taking_photo.png",
        "text": "Попробуй обязательно!",
        "onboarding": "onboarding_3",
    },
    "roll": {
        "photo": "src/bot/data/taking_photo.png",
        "text": "Попробуй обязательно!",
        "onboarding": "onboarding_3",
    },
    "default": {
        "photo": "src/bot/data/start.png",
        "text": "Привет! Давай познакомимся 🌿",
        "onboarding": "onboarding_3",
    },
}


# fmt: on
